In [1]:
from pyspark.sql import SparkSession

In [7]:
spark = (SparkSession.builder.appName('spark introduction').master('local[*]').getOrCreate())

25/02/25 16:08:27 WARN Utils: Your hostname, codespaces-7aea8b resolves to a loopback address: 127.0.0.1; using 10.0.1.65 instead (on interface eth0)
25/02/25 16:08:27 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/02/25 16:08:28 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [21]:
from pyspark.sql.types import _parse_datatype_string
from datetime import date
schema_string = 'id int,name string,department string,age int,gender string,salary integer,hire_date date'
emp_schema = _parse_datatype_string(schema_string)
# Sample Employee Data (40 rows)
employee_data = [
    (1, "Alice Johnson", "HR", 29, "F", 60000, date(2018, 5, 23)),
    (2, "Bob Smith", "Engineering", 35, "M", 80000, date(2016, 7, 19)),
    (3, "Charlie Brown", "Finance", 41, "M", 75000, date(2015, 6, 10)),
    (4, "David Wilson", "Marketing", 30, "M", 72000, date(2019, 3, 5)),
    (5, "Emma Davis", "Sales", 27, "F", 68000, date(2021, 8, 11)),
    (6, "Frank Thomas", "HR", 32, "M", 61000, date(2017, 4, 28)),
    (7, "Grace White", "Engineering", 38, "F", 82000, date(2014, 9, 15)),
    (8, "Hank Green", "Finance", 45, "M", 76000, date(2012, 10, 3)),
    (9, "Ivy Adams", "Marketing", 28, "F", 73000, date(2020, 1, 22)),
    (10, "Jack Carter", "Sales", 33, "M", 69000, date(2016, 12, 14)),
    (11, "Kevin Scott", "HR", 31, "M", 62000, date(2017, 2, 9)),
    (12, "Liam Lewis", "Engineering", 40, "M", 83000, date(2013, 7, 20)),
    (13, "Mia Martinez", "Finance", 39, "F", 77000, date(2014, 8, 30)),
    (14, "Nathan Walker", "Marketing", 29, "M", 74000, date(2019, 5, 12)),
    (15, "Olivia Hall", "Sales", 26, "F", 70000, date(2022, 3, 8)),
    (16, "Paul Young", "HR", 37, "M", 63000, date(2015, 6, 17)),
    (17, "Quincy King", "Engineering", 34, "M", 84000, date(2016, 10, 5)),
    (18, "Rachel Turner", "Finance", 42, "F", 78000, date(2012, 11, 23)),
    (19, "Samuel Parker", "Marketing", 30, "M", 75000, date(2018, 2, 19)),
    (20, "Tina Evans", "Sales", 28, "F", 71000, date(2020, 6, 3)),
    (21, "Umar Brown", "HR", 36, "M", 64000, date(2014, 9, 25)),
    (22, "Victor Reed", "Engineering", 33, "M", 85000, date(2017, 1, 14)),
    (23, "Wendy Baker", "Finance", 40, "F", 79000, date(2013, 12, 9)),
    (24, "Xander Scott", "Marketing", 31, "M", 76000, date(2019, 4, 28)),
    (25, "Yasmine Hughes", "Sales", 27, "F", 72000, date(2021, 5, 21)),
    (26, "Zack Foster", "HR", 39, "M", 65000, date(2013, 3, 14)),
    (27, "Ava Cooper", "Engineering", 32, "F", 86000, date(2018, 9, 16)),
    (28, "Ben Garcia", "Finance", 37, "M", 80000, date(2015, 10, 7)),
    (29, "Catherine Lopez", "Marketing", 28, "F", 77000, date(2020, 2, 11)),
    (30, "Daniel Mitchell", "Sales", 35, "M", 73000, date(2017, 11, 30)),
    (31, "Eliza Robinson", "HR", 31, "F", 66000, date(2018, 7, 18)),
    (32, "Felix Turner", "Engineering", 45, "M", 87000, date(2012, 6, 4)),
    (33, "Gabriella Adams", "Finance", 29, "F", 81000, date(2019, 8, 20)),
    (34, "Henry White", "Marketing", 41, "M", 78000, date(2014, 5, 14)),
    (35, "Isla Collins", "Sales", 30, "F", 74000, date(2020, 4, 9)),
    (36, "Jacob Rivera", "HR", 38, "M", 67000, date(2016, 1, 23)),
    (37, "Katie Bell", "Engineering", 33, "F", 88000, date(2018, 10, 6)),
    (38, "Leo Scott", "Finance", 42, "M", 82000, date(2013, 9, 12)),
    (39, "Megan Foster", "Marketing", 31, "F", 79000, date(2019, 11, 27)),
    (40, "Noah Carter", "Sales", 28, "M", 75000, date(2021, 12, 1))
]

In [22]:
df = spark.createDataFrame(data=employee_data,schema=emp_schema)

In [23]:
df.rdd.getNumPartitions()

2

In [24]:
df.show()

+---+-------------+-----------+---+------+------+----------+
| id|         name| department|age|gender|salary| hire_date|
+---+-------------+-----------+---+------+------+----------+
|  1|Alice Johnson|         HR| 29|     F| 60000|2018-05-23|
|  2|    Bob Smith|Engineering| 35|     M| 80000|2016-07-19|
|  3|Charlie Brown|    Finance| 41|     M| 75000|2015-06-10|
|  4| David Wilson|  Marketing| 30|     M| 72000|2019-03-05|
|  5|   Emma Davis|      Sales| 27|     F| 68000|2021-08-11|
|  6| Frank Thomas|         HR| 32|     M| 61000|2017-04-28|
|  7|  Grace White|Engineering| 38|     F| 82000|2014-09-15|
|  8|   Hank Green|    Finance| 45|     M| 76000|2012-10-03|
|  9|    Ivy Adams|  Marketing| 28|     F| 73000|2020-01-22|
| 10|  Jack Carter|      Sales| 33|     M| 69000|2016-12-14|
| 11|  Kevin Scott|         HR| 31|     M| 62000|2017-02-09|
| 12|   Liam Lewis|Engineering| 40|     M| 83000|2013-07-20|
| 13| Mia Martinez|    Finance| 39|     F| 77000|2014-08-30|
| 14|Nathan Walker|  Marketing| 29|     M| 74000|2019-05-12|
| 15|  Olivia Hall|      Sales| 26|     F| 70000|2022-03-08|
| 16|   Paul Young|         HR| 37|     M| 63000|2015-06-17|
| 17|  Quincy King|Engineering| 34|     M| 84000|2016-10-05|
| 18|Rachel Turner|    Finance| 42|     F| 78000|2012-11-23|
| 19|Samuel Parker|  Marketing| 30|     M| 75000|2018-02-19|
| 20|   Tina Evans|      Sales| 28|     F| 71000|2020-06-03|
+---+-------------+-----------+---+------+------+----------+
only showing top 20 rows

In [25]:
#printSchema
df.printSchema()

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: integer (nullable = true)
 |-- hire_date: date (nullable = true)

In [29]:
#casting columns
#select id,name,age,cast(salary as double) as salary from df
#emp_casted = df.selectExpr('id','name','age','cast(salary as double) as salary')
#another way of casting
from pyspark.sql.functions import col,cast
emp_casted_1 = df.select('id','name','age',col('salary').cast('double'))

In [30]:
emp_casted_1.printSchema()

root
 |-- id: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- salary: double (nullable = true)

In [31]:
#adding columns
#select id,name,age,salary,(salary*0.2) as tax from emp
emp_taxed = emp_casted_1.withColumn('tax',col('salary')*0.2)

In [32]:
emp_taxed.show()

+---+-------------+---+-------+-------+
| id|         name|age| salary|    tax|
+---+-------------+---+-------+-------+
|  1|Alice Johnson| 29|60000.0|12000.0|
|  2|    Bob Smith| 35|80000.0|16000.0|
|  3|Charlie Brown| 41|75000.0|15000.0|
|  4| David Wilson| 30|72000.0|14400.0|
|  5|   Emma Davis| 27|68000.0|13600.0|
|  6| Frank Thomas| 32|61000.0|12200.0|
|  7|  Grace White| 38|82000.0|16400.0|
|  8|   Hank Green| 45|76000.0|15200.0|
|  9|    Ivy Adams| 28|73000.0|14600.0|
| 10|  Jack Carter| 33|69000.0|13800.0|
| 11|  Kevin Scott| 31|62000.0|12400.0|
| 12|   Liam Lewis| 40|83000.0|16600.0|
| 13| Mia Martinez| 39|77000.0|15400.0|
| 14|Nathan Walker| 29|74000.0|14800.0|
| 15|  Olivia Hall| 26|70000.0|14000.0|
| 16|   Paul Young| 37|63000.0|12600.0|
| 17|  Quincy King| 34|84000.0|16800.0|
| 18|Rachel Turner| 42|78000.0|15600.0|
| 19|Samuel Parker| 30|75000.0|15000.0|
| 20|   Tina Evans| 28|71000.0|14200.0|
+---+-------------+---+-------+-------+
only showing top 20 rows

In [33]:
#adding static values as column values to dataset
#literals
#select id,name,age,salary,tax,1 as columnone,'two' as columntwo from emp_tax
from pyspark.sql.functions import lit
emp_new_cols = emp_taxed.withColumn('coumnone',lit(1)).withColumn('columntwo',lit('two'))

In [34]:
emp_new_cols.show()

+---+-------------+---+-------+-------+--------+---------+
| id|         name|age| salary|    tax|coumnone|columntwo|
+---+-------------+---+-------+-------+--------+---------+
|  1|Alice Johnson| 29|60000.0|12000.0|       1|      two|
|  2|    Bob Smith| 35|80000.0|16000.0|       1|      two|
|  3|Charlie Brown| 41|75000.0|15000.0|       1|      two|
|  4| David Wilson| 30|72000.0|14400.0|       1|      two|
|  5|   Emma Davis| 27|68000.0|13600.0|       1|      two|
|  6| Frank Thomas| 32|61000.0|12200.0|       1|      two|
|  7|  Grace White| 38|82000.0|16400.0|       1|      two|
|  8|   Hank Green| 45|76000.0|15200.0|       1|      two|
|  9|    Ivy Adams| 28|73000.0|14600.0|       1|      two|
| 10|  Jack Carter| 33|69000.0|13800.0|       1|      two|
| 11|  Kevin Scott| 31|62000.0|12400.0|       1|      two|
| 12|   Liam Lewis| 40|83000.0|16600.0|       1|      two|
| 13| Mia Martinez| 39|77000.0|15400.0|       1|      two|
| 14|Nathan Walker| 29|74000.0|14800.0|       1|      two|
| 15|  Olivia Hall| 26|70000.0|14000.0|       1|      two|
| 16|   Paul Young| 37|63000.0|12600.0|       1|      two|
| 17|  Quincy King| 34|84000.0|16800.0|       1|      two|
| 18|Rachel Turner| 42|78000.0|15600.0|       1|      two|
| 19|Samuel Parker| 30|75000.0|15000.0|       1|      two|
| 20|   Tina Evans| 28|71000.0|14200.0|       1|      two|
+---+-------------+---+-------+-------+--------+---------+
only showing top 20 rows

In [35]:
#renaming columns
#select id as emp_id,age,name,salary,tax,columnone,columntwo from emp_new_cols
emp_renmaed = emp_new_cols.withColumnRenamed('id','emp_id')

In [36]:
emp_renmaed.show()

+------+-------------+---+-------+-------+--------+---------+
|emp_id|         name|age| salary|    tax|coumnone|columntwo|
+------+-------------+---+-------+-------+--------+---------+
|     1|Alice Johnson| 29|60000.0|12000.0|       1|      two|
|     2|    Bob Smith| 35|80000.0|16000.0|       1|      two|
|     3|Charlie Brown| 41|75000.0|15000.0|       1|      two|
|     4| David Wilson| 30|72000.0|14400.0|       1|      two|
|     5|   Emma Davis| 27|68000.0|13600.0|       1|      two|
|     6| Frank Thomas| 32|61000.0|12200.0|       1|      two|
|     7|  Grace White| 38|82000.0|16400.0|       1|      two|
|     8|   Hank Green| 45|76000.0|15200.0|       1|      two|
|     9|    Ivy Adams| 28|73000.0|14600.0|       1|      two|
|    10|  Jack Carter| 33|69000.0|13800.0|       1|      two|
|    11|  Kevin Scott| 31|62000.0|12400.0|       1|      two|
|    12|   Liam Lewis| 40|83000.0|16600.0|       1|      two|
|    13| Mia Martinez| 39|77000.0|15400.0|       1|      two|
|    14|Nathan Walker| 29|74000.0|14800.0|       1|      two|
|    15|  Olivia Hall| 26|70000.0|14000.0|       1|      two|
|    16|   Paul Young| 37|63000.0|12600.0|       1|      two|
|    17|  Quincy King| 34|84000.0|16800.0|       1|      two|
|    18|Rachel Turner| 42|78000.0|15600.0|       1|      two|
|    19|Samuel Parker| 30|75000.0|15000.0|       1|      two|
|    20|   Tina Evans| 28|71000.0|14200.0|       1|      two|
+------+-------------+---+-------+-------+--------+---------+
only showing top 20 rows

In [37]:
#remove columns
emp_dropped = emp_renmaed.drop('columntwo')

In [38]:
emp_dropped.show()

+------+-------------+---+-------+-------+--------+
|emp_id|         name|age| salary|    tax|coumnone|
+------+-------------+---+-------+-------+--------+
|     1|Alice Johnson| 29|60000.0|12000.0|       1|
|     2|    Bob Smith| 35|80000.0|16000.0|       1|
|     3|Charlie Brown| 41|75000.0|15000.0|       1|
|     4| David Wilson| 30|72000.0|14400.0|       1|
|     5|   Emma Davis| 27|68000.0|13600.0|       1|
|     6| Frank Thomas| 32|61000.0|12200.0|       1|
|     7|  Grace White| 38|82000.0|16400.0|       1|
|     8|   Hank Green| 45|76000.0|15200.0|       1|
|     9|    Ivy Adams| 28|73000.0|14600.0|       1|
|    10|  Jack Carter| 33|69000.0|13800.0|       1|
|    11|  Kevin Scott| 31|62000.0|12400.0|       1|
|    12|   Liam Lewis| 40|83000.0|16600.0|       1|
|    13| Mia Martinez| 39|77000.0|15400.0|       1|
|    14|Nathan Walker| 29|74000.0|14800.0|       1|
|    15|  Olivia Hall| 26|70000.0|14000.0|       1|
|    16|   Paul Young| 37|63000.0|12600.0|       1|
|    17|  Quincy King| 34|84000.0|16800.0|       1|
|    18|Rachel Turner| 42|78000.0|15600.0|       1|
|    19|Samuel Parker| 30|75000.0|15000.0|       1|
|    20|   Tina Evans| 28|71000.0|14200.0|       1|
+------+-------------+---+-------+-------+--------+
only showing top 20 rows

In [41]:
#filter data
emp_filtered = emp_dropped.where('tax > 10000')

In [42]:
emp_filtered.show()

+------+-------------+---+-------+-------+--------+
|emp_id|         name|age| salary|    tax|coumnone|
+------+-------------+---+-------+-------+--------+
|     1|Alice Johnson| 29|60000.0|12000.0|       1|
|     2|    Bob Smith| 35|80000.0|16000.0|       1|
|     3|Charlie Brown| 41|75000.0|15000.0|       1|
|     4| David Wilson| 30|72000.0|14400.0|       1|
|     5|   Emma Davis| 27|68000.0|13600.0|       1|
|     6| Frank Thomas| 32|61000.0|12200.0|       1|
|     7|  Grace White| 38|82000.0|16400.0|       1|
|     8|   Hank Green| 45|76000.0|15200.0|       1|
|     9|    Ivy Adams| 28|73000.0|14600.0|       1|
|    10|  Jack Carter| 33|69000.0|13800.0|       1|
|    11|  Kevin Scott| 31|62000.0|12400.0|       1|
|    12|   Liam Lewis| 40|83000.0|16600.0|       1|
|    13| Mia Martinez| 39|77000.0|15400.0|       1|
|    14|Nathan Walker| 29|74000.0|14800.0|       1|
|    15|  Olivia Hall| 26|70000.0|14000.0|       1|
|    16|   Paul Young| 37|63000.0|12600.0|       1|
|    17|  Quincy King| 34|84000.0|16800.0|       1|
|    18|Rachel Turner| 42|78000.0|15600.0|       1|
|    19|Samuel Parker| 30|75000.0|15000.0|       1|
|    20|   Tina Evans| 28|71000.0|14200.0|       1|
+------+-------------+---+-------+-------+--------+
only showing top 20 rows

In [43]:
#limit
emp_limit = emp_filtered.limit(5)

In [44]:
emp_limit.show()

+------+-------------+---+-------+-------+--------+
|emp_id|         name|age| salary|    tax|coumnone|
+------+-------------+---+-------+-------+--------+
|     1|Alice Johnson| 29|60000.0|12000.0|       1|
|     2|    Bob Smith| 35|80000.0|16000.0|       1|
|     3|Charlie Brown| 41|75000.0|15000.0|       1|
|     4| David Wilson| 30|72000.0|14400.0|       1|
|     5|   Emma Davis| 27|68000.0|13600.0|       1|
+------+-------------+---+-------+-------+--------+